ServiceDesk/src/Documents/ИзменениеСостоянияЗаявки/ИзменениеСостоянияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеСостоянияЗаявки</name>
  <registerRecords>AccumulationRegister.СтатусыЗаявок</registerRecords>
  <registerRecords>AccumulationRegister.ВыполненыеЗаявки</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаявки</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаявкиСтарое</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </attributes>
</mdclass:Document>

ServiceDesk/src/AccumulationRegisters/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтатусыЗаявок</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СостояниеЗаявки</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеЗаявкиСтарое</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ServiceDesk/src/AccumulationRegisters/ВыполненыеЗаявки/ВыполненыеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыполненыеЗаявки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Трудоёмкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаПользователя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ServiceDesk/src/Catalogs/СостоянияЗаявки/СостоянияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗаявки</name>
  <predefined>
    <items>
      <name>ВОжидании</name>
      <description>В ожидании</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Закрыта</name>
      <description>Закрыта</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаКонтроле</name>
      <description>На контроле</description>
    </items>
    <items>
      <name>НаПроверке</name>
      <description>На проверке</description>
    </items>
    <items>
      <name>НаСогласовании</name>
      <description>На согласовании</description>
    </items>
    <items>
      <name>ОжиданиеОтвета</name>
      <description>Ожидание ответа заказчика</description>
    </items>
    <items>
      <name>ОписаниеПроектногоРешения</name>
      <description>Описание проектного решения</description>
    </items>
    <items>
      <name>Отменена</name>
      <description>Отменена</description>
    </items>
    <items>
      <name>ПереданаКИсполнению</name>
      <description>Передана к исполнению</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения1</name>
      <description>Согласование проектного решения</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения2</name>
      <description>Согласование проектного решения</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяУстанавливаемойДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнениеПлановыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/Documents/ИзменениеСостоянияЗаявки/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	пЗапрос	= Новый Запрос;
	пЗапрос.Текст	= "ВЫБРАТЬ
	             	  |	СтатусыЗаявокОстатки.Заявка КАК Заявка,
	             	  |	СтатусыЗаявокОстатки.СостояниеЗаявки КАК СостояниеЗаявки,
	             	  |	СтатусыЗаявокОстатки.СостояниеЗаявкиСтарое КАК СостояниеЗаявкиСтарое
	             	  |ИЗ
	             	  |	РегистрНакопления.СтатусыЗаявок.Остатки(&МоментВремени, Заявка = &Заявка) КАК СтатусыЗаявокОстатки";

	пЗапрос.УстановитьПараметр("МоментВремени", МоментВремени());
	пЗапрос.УстановитьПараметр("Заявка", Заявка);
	
	Выборка	= пЗапрос.Выполнить().Выбрать();	
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.СтатусыЗаявок.Добавить();
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		Движение.Период 				= Дата;
		Движение.Заявка		 			= Выборка.Заявка;
		Движение.СостояниеЗаявки		= Выборка.СостояниеЗаявки;
		Движение.СостояниеЗаявкиСтарое	= Выборка.СостояниеЗаявкиСтарое;
		Движение.Количество 			= -1;		                        	
	КонецЦикла;
	
	Если СостояниеЗаявки <> Справочники.СостоянияЗаявки.Закрыта Тогда 		
		Движение = Движения.СтатусыЗаявок.Добавить();
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		Движение.Период 				= ЭтотОбъект.Дата;
		Движение.Заявка		 			= Заявка;
		Движение.СостояниеЗаявки		= СостояниеЗаявки;
		Движение.СостояниеЗаявкиСтарое	= СостояниеЗаявкиСтарое;		
		Движение.Количество 			= 1;		                        	
	КонецЕсли;	
	
	Если СостояниеЗаявки = Справочники.СостоянияЗаявки.Выполнена Тогда
		Движение = Движения.ВыполненыеЗаявки.Добавить();		
		Движение.Период 				= ЭтотОбъект.Дата;
		Движение.Заявка		 			= Заявка;				
		Движение.Количество 			= 1;
		Движение.Трудоёмкость 			= Заявка.Трудоёмкость;
	КонецЕсли;
	
	Если СостояниеЗаявкиСтарое = Справочники.СостоянияЗаявки.Выполнена И СостояниеЗаявки <> Справочники.СостоянияЗаявки.Закрыта Тогда
		Движение = Движения.ВыполненыеЗаявки.Добавить();		
		Движение.Период 				= ЭтотОбъект.Дата;
		Движение.Заявка		 			= Заявка;				
		Движение.Количество 			= -1;
		Движение.Трудоёмкость 			= -Заявка.Трудоёмкость;
	КонецЕсли;	
		
КонецПроцедуры
